@echo off
echo ===============================现在时间是:%time%================================
title= Git自动拉取上传脚本
color 2
echo ================正在查看当前目录================
echo 当前目录是：%cd%
echo;
echo ================正在从远程拉取笔记================
git.exe pull
echo =====================拉取成功=====================
cls
echo ==================================================================
echo ==================================================================
echo ================正在从本地上传笔记================
git.exe add .
git.exe commit -m ":sparkles: %date% %time%"
git.exe push origin main
echo =====================上传成功=====================
pause 摁任意键退出
exit