@echo off
cls
title XX网吧欢迎您.以下是随机公告  制作:TeZu4a雨龍
color a
mode con: cols=80 lines=40
@echo 您好.现在的时间是:
@echo.
set tm1=%time:~0,2%
set tm2=%time:~3,2%
set tm3=%time:~6,2%
echo %date% %tm1%点%TM2%分%TM3%秒
@echo.
@echo 上机前.请您用1-2分钟的时间认真看完此公告
@echo.
@echo 这对您也许会有一点帮助.确认不需要看的请点窗口上的 X 关闭即可
@echo.
@echo 特别提醒:禁止抽烟.上机前请确认携带了身份证或其他证件(如驾照.护照.军官证等)
@echo.
@echo 一:贵重物品如钱包.手机等请随身携带.不要搁置于电脑桌上.丢失网吧不负责
@echo.
@echo 二:为了您和他人有一个好的上网环境.请不要大声喧哗.吵闹.更不要将脚搁到电脑桌上
@echo.
@echo 三:为了让您可以快速登陆游戏.网吧采用了被动式的游戏更新程序.如在进入游戏前
@echo.
@echo    发现游戏没有更新到最新版本.请进入桌面上的"游戏更新"平台打开对应的更新程序
@echo.
@echo    整个游戏更新过程需要浪费您的1-2分钟时间.大型3D游戏可能需要3分钟左右.请谅解
@echo.
@echo 四:其他辅助程序如外挂.鼠标耳麦声音调整.输入法设置等在"游戏菜单"的"辅助工具"里
@echo.
@echo 五:网吧另提供游戏点卡充值.手机话费充值等服务.有需要的请到吧台咨询
@echo.
@echo 六:需要饮料零食的请到吧台自行购买.网管只负责解决电脑游戏问题.不是服务员.望理解
@echo.
@echo 七:如有其他意见或建议请登陆网吧主页留言.或联系QQ：326490提出.谢谢您的支持
@echo.
@echo    网吧主页http://192.168.1.3:520   邮件:tezu4a@vip.winzheng.com
@echo.
@echo 最后.祝您游戏愉快.按任意键退出此公告.BYEBYE
pause